# ListFields Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..ListFields Method
Schema Class See Also
---
The complete list of fields in the Schema, sorted by name.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Field> ListFields()
```

Visual Basic
---
```text
Public Function ListFields As IList(Of Field)
```

Visual C++
---
```text
public:
IList<Field^>^ ListFields()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Reading of Entities of this Schema is not allowed to the current add-in. |

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace